{
	"opr": [
		[
		"Дать определение умножения матриц. Коммутативна ли эта операция? Ответ пояснить.",
		"Дать определения ступенчатого вида матрицы и канонического вида матрицы.",
		"Перечислить элементарные преобразования строк матрицы.",
		"Сформулировать теорему о методе Гаусса (алгоритм приводить не нужно).",
		"Дать определения перестановки и подстановки.",
		"Дать определения знака и четности подстановки.",
		"Выписать общую формулу для вычисления определителя произвольного порядка.",
		"Какие три условия достаточно наложить на функцию от столбцов матрицы, чтобы она обязательно была детерминантом?",
		"Выписать формулы для разложения определителя по строке и по столбцу.",
		"Что такое фальшивое разложение?",
		"Выписать формулы Крамера для квадратной матрицы произвольного порядка. Когда с их помощью можно найти решение СЛАУ?",
		"Что такое дополняющий минор и что такое алгебраическое дополнение?",
		"Дать определение союзной матрицы.",
		"Дать определение обратной матрицы. Сформулировать критерий ее существования.",
		"Выписать формулу для нахождения обратной матрицы.",
		"Как найти обратную к произведению матриц?",
		"Дать определение минора.",
		"Дать определение базисного минора. Какие строки называются базисными?",
		"Дать определение линейной комбинации строк. Что такое нетривиальная линейная комбинация?",
		"Дать определение линейной зависимости строк матрицы.",
		"Дать определение линейно независимых столбцов матрицы.",
		"Сформулировать критерий линейной зависимости.",
		"Дать определение ранга матрицы.",
		"Сформулировать теорему о базисном миноре.",
		"Сформулировать теорему о ранге матрицы.",
		"Сформулировать критерий невырожденности квадратной матрицы.",
		"Выписать свойства решений однородных и неоднородных СЛАУ.",
		"Сформулировать теорему Кронекера-Капелли.",
		"Дать определение фундаментальной системы решений (ФСР) однородной СЛАУ."
		],
		[
		"Сформулируйте теорему о структуре общего решения однородной системы линейных алгебраических уравнений.",
		"Сформулируйтетеоремуоструктуреобщегорешениянеоднороднойсистемылинейныхалгебраическихуравнений.",
		"Что такое алгебраическая и тригонометрическая форма записи комплексного числа?",
		"Дайте определения модуля и аргумента комплексного числа. Что такое главное значение аргумента комплексного числа?",
		"Сложение, умножение комплексных чисел. Что происходит с аргументами и модулями комплексных чисел при умножении?",
		"Что такое комплексное сопряжение? Как можно делить комплексные числа?",
		"Выпишите формулу Муавра.",
		"Как найти комплексные корни n-ой степени из комплексного числа? Сделайте эскиз, на котором отметьте исходное число и все корни из него.",
		"Сформулируйте основную теорему алгебры. Сформулировать теорему Безу.",
		"Выпишите формулу Эйлера. Выпишите выражения для синуса и косинуса через экспоненту.",
		"Выпишите формулы Виета.",
		"Какие многочлены называются неприводимыми?",
		"Сформулируйте утверждение о разложение многочленов на неприводимые множители над комплексными числами.",
		"Сформулируйте утверждение о разложение многочленов на неприводимые множители над действительными числами.",
		"Дайте определение векторного произведения векторов в трехмерном пространстве.",
		"Сформулируйте три алгебраических свойства векторного произведения.",
		"Выпишите формулу для вычисления векторного произведения в координатах, заданных в ортонормированном базисе.",
		"Дайте определение смешанного произведения векторов. Как вычислить объем тетраэдра с помощью смешанного произведения?",
		"Выпишите формулу для вычисления смешанного произведения в координатах, заданных в ортонормированном базисе.",
		"Сформулируйте критерий компланарности трех векторов с помощью смешанного произведения.",
		"Дайте определение прямоугольной декартовой системы координат.",
		"Что такое уравнение поверхности и его геометрический образ?",
		"Сформулируйте теорему о том, что задает любое линейное уравнение на координаты точки в трехмерном пространстве.",
		"Дайте определение нормали к плоскости.",
		"Выпишите формулу для расстояния от точки до плоскости.",
		"Общие уравнения прямой. Векторное уравнение прямой. Параметрические и канонические уравнения прямой.",
		"Сформулируйте критерий принадлежности двух прямых одной плоскости.",
		"Выпишите формулу для вычисления расстояния от точки до прямой.",
		"Выпишите формулу для вычисления расстояния между двумя скрещивающимися прямыми.",
		"Какие бинарные операции называются ассоциативными, а какие коммутативными?",
		"Дайте определения полугруппы и моноида. Приведите примеры.",
		"Сформулируйте определение группы.",
		"Что такое симметрическая группа? Укажите число элементов в ней.",
		"Что такое общая линейная и специальная линейная группы?",
		"Сформулируйте определение абелевой группы. Приведите пример.",
		"Дайте определение подгруппы. Приведите пример группы и ее подгруппы.",
		"Дайте определение гомоморфизма групп. Что такое ядро гомоморфизма групп?",
		"Дайте определение изоморфизма групп. Приведите пример.",
		"Сформулируйте определение циклической группы. Приведите пример.",
		"Дайте определение порядка элемента группы.",
		"Дайте определение таблицы Кэли.",
		"Сколько существует, с точностью до изоморфизма, циклических групп данного порядка?"
		],
		[
		"Что такое группа диэдра? Что такое знакопеременная группа? Укажите число элементов в них.",
		"Сформулируйте утверждение о связи порядка элемента, порождающего циклическую группу, с порядком группы.",
		"Сформулируйте утверждение о том, какими могут быть подгруппы группы целых чисел по сложению.",
		"Дайте определение левого смежного класса по некоторой подгруппе.",
		"Дайте определение нормальной подгруппы. Что такое индекс подгруппы?",
		"Сформулируйте теорему Лагранжа.",
		"Сформулируйте две леммы, которые нужны для доказательства теоремы Лагранжа.",
		"Сформулируйте три следствия из теоремы Лагранжа.",
		"Сформулируйте критерий нормальности подгруппы, использующий сопряжение.",
		"Дайте определение факторгруппы.",
		"Что такое естественный гомоморфизм?",
		"Сформулируйте критерий нормальности подгруппы, использующий понятие ядра гомоморфизма.",
		"Сформулируйте теорему о гомоморфизме групп. Приведите пример.",
		"Что такое прямое произведение групп?",
		"Что такое действие группы на множестве?",
		"Сформулируйте определения орбиты и стабилизатора.",
		"Сформулируйте утверждение о количестве элементов в орбите действия конечной группы.",
		"Приведите три примера действия группы на себе.",
		"Сформулируйте определение автоморфизма и внутреннего автоморфизма.",
		"Что такое центр группы? Что можно сказать о его свойствах?",
		"Чему изоморфна факторгруппа группы по ее центру?",
		"Сформулируйте теорему Кэли.",
		"Дайте определение кольца.",
		"Что такое коммутативное кольцо? Приведите примеры коммутативного и некоммутативного колец.",
		"Что такое подкольцо, порожденное множеством?",
		"Дайте определение делителей нуля.",
		"Дайте определение целостного кольца. Приведите пример.",
		"Какие элементы кольца называются обратимыми?",
		"Сформулируйте критерий целостности для нетривиального коммутативного кольца с единицей.",
		"Дайте определение поля. Приведите три примера.",
		"Дайте определение подполя. Привести пример пары: поле и его собственное подполе.",
		"Дайте определение характеристики поля. Привести примеры: поля конечной положительной характеристики и поля нулевой характеристики.",
		"Что такое простое подполе?",
		"Сформулируйте утверждение о том, каким будет простое подполе в зависимости от характеристики.",
		"Дайте определение расширения поля, полученного с помощью присоединения элемента. Приведите пример.",
		"Дайте определение идеала. Что такое главный идеал?",
		"Сформулируйте определение гомоморфизма колец.",
		"Сформулируйте теорему о гомоморфизме колец. Приведите пример.",
		"Сформулируйте теорему о том, когда факторколько кольца многочленов над полем само является полем.",
		"Сформулируйте критерий того, что кольцо вычетов по модулю p является полем.",
		"Дайте определение алгебраического элемента над полем.",
		"Сформулируйте китайскую теорему об остатках (через изоморфизм колец).",
		"Что такое поле рациональных дробей?",
		"Сформулируйте утверждение о том, сколько элементов может быть в конечном поле и как устроены его подполя.",
		"Сформулируйте утверждение о том, что любое конечное поле может быть реализовано как факторкольцо кольца многочленов по некоторому идеалу.",
		"Дайте определение линейного (векторного) пространства.",
		"Дайте определение базиса линейного (векторного) пространства.",
		"Что такое размерность пространства?",
		"Дайте определение матрицы перехода от старого базиса линейного пространства к новому.",
		"Выпишите формулу для описания изменения координат вектора при изменении базиса.",
		"Дайте определение подпространства в линейном пространстве.",
		"Дайте определения линейной оболочки конечного набора векторов и ранга системы векторов.",
		"Дайте определения суммы и прямой суммы подпространств.",
		"Сформулируйте утверждение о связи размерности суммы и пересечения подпространств.",
		"Дайте определение линейного отображения. Приведите пример.",
		"Дайте определение матрицы линейного отображения.",
		"Выпишите формулу для преобразования матрицы линейного отображения при замене базиса. Как выглядит формула в случае линейного оператора?",
		"Сформулируйте определения ядра и образа линейного отображения.",
		"Сформулируйте утверждение о связи размерностей ядра и образа линейного отображения.",
		"Дайте определения собственного вектора и собственного значения линейного оператора.",
		"Дайте определения характеристического уравнения и характеристического многочлена квадратной матри- цы.",
		"Сформулируйте утверждение о связи характеристического уравнения и спектра линейного оператора.",
		"Дайте определение собственного подпространства.",
		"Дайте определения алгебраической и геометрической кратности собственного значения. Какое неравенство их связывает?",
		"Дайте определение следа матрицы. Как меняется след матрицы оператора при замене базиса?",
		"Каким свойством обладают собственные векторы линейного оператора, отвечающие различным собственным значениям?",
		"Сформулируйте критерий диагональности матрицы оператора.",
		"Сформулируйте критерий диагонализируемости матрицы оператора с использованием понятия геометриче- ской кратности.",
		"Сформулируйте теорему Гамильтона-Кэли.",
		"Дайте определение жордановой клетки. Сформулируйте теорему о жордановой нормальной форме матрицы оператора."
		],
		[
		"Выпишите формулу для количества жордановых клеток заданного размера.",
		"Дайте определение алгебры над полем. Приведите два примера.",
		"Дайте определение модуля над кольцом. Приведите два примера.",
		"Дайте определение евклидова пространства.",
		"Выпишите неравенства Коши-Буняковского и треугольника.",
		"Дайте определения ортогонального и ортонормированного базисов.",
		"Опишите алгоритм ортогонализации Грама-Шмидта.",
		"Дайте определение матрицы Грама.",
		"Дайте определение сопряженного пространства.",
		"Выпишите формулу для преобразования координат ковектора при переходе к другому базису.",
		"Дайте определение взаимных базисов.",
		"Дайте определение биортогонального базиса.",
		"Сформулируйте критерий линейной зависимости с помощью матрицы Грама.",
		"Выпишите формулу для преобразования матрицы Грама при переходе к новому базису.",
		"Дайте определение ортогонального дополнения.",
		"Дайте определения ортогональной проекции вектора на подпространство и ортогональной составляющей.",
		"Выпишите формулу для ортогональной проекции вектора на подпространство, заданное как линейная оболочка данного линейно независимого набора векторов.",
		"Выпишите формулу для вычисления расстояния с помощью определителей матриц Грама.",
		"Дайте определение сопряженного оператора в евклидовом пространстве.",
		"Дайте определение самосопряженного (симметрического) оператора.",
		"Что можно сказать про ортогональное дополнение к образу сопряженного оператора?",
		"Сформулируйте теорему Фредгольма и альтернативу Фредгольма.",
		"Дайте определение ортогонального оператора.",
		"Как найти матрицу сопряженного оператора в произвольном базисе?",
		"Сформулируйте определение ортогональной матрицы.",
		"Что можно сказать про собственные векторы самосопряженного оператора, отвечающие разным собственным значениям?",
		"Каким свойством обладают собственные значения самосопряженного оператора?",
		"Сформулируйте критерий ортогональности оператора, использующий его матрицу.",
		"Каков канонический вид ортогонального оператора? Сформулируйте теорему Эйлера.",
		"Сформулируйте теорему о существовании для самосопряженного оператора базиса из собственных векторов.",
		"Сформулируйте теорему о сингулярном разложении.",
		"Сформулируйте утверждение о QR-разложении.",
		"Сформулируйте утверждение о полярном разложении.",
		"Дайте определени билинейной формы.",
		"Как меняется матрица билинейной формы при замене базиса?",
		"Дайте определение квадратичной формы.",
		"Выпишите формулу для преобразования квадратичной формы при замене базиса.",
		"Дайте определения положительной и отрицательной определенности квадратичной формы.",
		"Какую квадратичную форму называют знакопеременной?",
		"Сформулируйте критерий Сильвестра положительной определенности квадратичной формы.",
		"Сформулируйте следствие критерия Сильвестра для отрицательной определенности квадратичной формы."
		]
	],
	"theor": [
		[
		"Что происходит с произведением матриц при транспонировании? Ответ обосновать.",
		"Какие три условия достаточно наложить на функцию от столбцов матрицы, чтобы она обязательно была детерминантом? Ответ обоснуйте для матриц второго порядка.",
		"Выписать формулы Крамера для квадратной матрицы произвольного порядка и доказать их.",
		"Сформулировать и доказать критерий линейной зависимости.",
		"Как связан ранг транспонированной матрицы с рангом исходной матрицы? Ответ обосновать.",
		"Сформулировать и доказать следствие теоремы о базисном миноре для квадратных матриц (критерий невырожденности).",
		"Сформулировать и доказать критерий существования обратной матрицы. Свойства определителя предполагаются известными. Единственна ли обратная матрица? Ответ обоснуйте.",
		"Сформулируйте теорему Кронекера-Капелли и докажите ее.",
		"Сформулируйте и докажите теорему о базисном миноре.",
		"Сформулируйте и докажите теорему о ранге матрицы (теорема о базисном миноре предполагается известной).",
		"Сформулируйте критерий существования ненулевого решения однородной системы линейных уравнений с квадратной матрицей и докажите его.",
		"Дайте определение фундаментальной системы решений (ФСР) однородной системы линейных уравнений. Докажите теорему о существовании ФСР."
		],
		[
		"Сформулируйте теорему о структуре общего решения неоднородной системы линейных алгебраических уравнений и докажите ее (теорема о структуре общего решения однородной системы линейных алгебраических уравнений предполагается известной).",
		"Выпишите формулу для вычисления скалярного произведения векторов, заданных своими координатами в произвольном базисе трехмерного пространства, и приведите ее вывод.",
		"Выпишите формулу для вычисления векторного произведения в правом ортонормированном базисе трехмерного пространства и приведите ее вывод.",
		"Докажите теорему о том, что любое линейное уравнение на координаты точки в трехмерном пространстве задает плоскость и что любая плоскость определяется линейным уравнением.",
		"Выпишите формулу для вычисления расстояния от точки до плоскости и приведите ее вывод.",
		"Выпишите формулу Муавра и докажите ее.",
		"Докажите теорему о структуре общего решения однородной системы линейных алгебраических уравнений, то есть о том, что произвольное решение однородной СЛАУ может быть представлено в виде линейной комбинации элементов ФСР."
		],
		[
		"Сформулируйте и докажите утверждение о том, какими могут быть подгруппы группы целых чисел по сложению.",
		"Сформулируйте и докажите теорему Лагранжа (включая доказательство лемм). Сформулируйте три следствия из теоремы Лагранжа.",
		"Сформулируйте и докажите критерий нормальности подгруппы, использующий сопряжение.",
		"Сформулируйте и докажите критерий нормальности подгруппы, использующий понятие ядра гомоморфизма.",
		"Сформулируйте и докажите теорему о гомоморфизме групп.",
		"Докажите, что центр группы является ее нормальной подгруппой.",
		"Сформулируйте и докажите утверждение о том, чему изоморфна факторгруппа группы по ее центру.",
		"Сформулируйте и докажите теорему Кэли.",
		"Сформулируйте и докажите критерий того, что кольцо вычетов по модулю p является полем.",
		"Выпишите и докажите формулу для описания изменения координат вектора при изменении базиса.",
		"Выпишите формулу для преобразования матрицы линейного отображения при замене базиса и докажите ее.",
		"Сформулируйте и докажите утверждение о связи размерностей ядра и образа линейного отображения.",
		"Сформулируйте и докажите утверждение о связи характеристического уравнения и спектра линейного оператора.",
		"Сформулируйте и докажите утверждение о том, каким свойством обладают собственные векторы линейного оператора, отвечающие различным собственным значениям.",
		"Сформулируйте и докажите критерий диагональности матрицы оператора.",
		"Сформулируйте и докажите утверждение о количестве элементов в орбите действия конечной группы.",
		"Сформулируйте и докажите утверждение о том, каким будет простое подполе в зависимости от характеристики.",
		"Сформулируйтеидокажитетеоремуотом,чтодействиелинейногооператоравконечномерномпространстве полностью определяется матрицей линейного оператора.",
		"Каким свойством обладает оператор в n-мерном вещественном пространстве, у которого есть n различных действительных корней? Ответ обоснуйте."
		],
		[
		"Выпишите и докажите формулу для преобразования координат ковектора при переходе к другому базису.",
		"Выпишите и докажите неравенство Коши-Буняковского. Выпишите и докажите неравенство треугольника.",
		"Докажите теорему о том, что евклидово пространство можно представить в виде прямой суммы подпространства и его ортогонального дополнения.",
		"Выпишите формулу для преобразования матрицы Грама при переходе к новому базису и докажите ее. Что происходит с определителем матрицы Грама при применении процесса ортогонализации Грама-Шмидта? Что можно сказать про знак определителя матрицы Грама? Ответ обоснуйте.",
		"Сформулируйте и докажите критерий линейной зависимости набора векторов с помощью матрицы Грама.",
		"Выпишите формулу для ортогональной проекции вектора на подпространство, заданное как линейная оболочка данного линейно независимого набора векторов, и докажите ее.",
		"Докажите, что для любого оператора в конечномерном евклидовом пространстве существует сопряженный оператор.",
		"Сформулируйте и докажите свойство собственных векторов самосопряженного оператора, отвечающих разным собственным значениям.",
		"Каким свойством обладают собственные значения самосопряженного оператора? Ответ обоснуйте.",
		"Что можно сказать про ортогональное дополнение к образу сопряженного оператора? Ответ обоснуйте. Сформулируйте и докажите теорему Фредгольма.",
		"Сформулируйте и докажите теорему о том, что ортогональный оператор переводит ортонормированный базис в ортонормированный. Верно ли обратно? Ответ обоснуйте.",
		"Сформулируйте и докажите критерий ортогональности оператора, использующий его матрицу.",
		"Сформулируйте теорему о существовании для самосопряженного оператора базиса из собственных векторов. Приведите доказательство в случае различных вещественных собственных значений.",
		"Сформулируйте и докажите утверждение о QR-разложении.",
		"Сформулируйте и докажите теорему о сингулярном разложении.",
		"Как меняется матрица билинейной формы при замене базиса? Как меняется матрица квадратичной формы при замене базиса? Ответ обоснуйте.",
		"Сформулируйте и докажите (включая лемму) теорему об инвариантности ранга матрицы квадратичной формы."
		]
	]
}